artillery.yml
config:
  # target: 'http://localhost:8083'
  # target: 'http://localhost:9000'
  # CAREFUL about this from hack reactor IP address, it will get blocked
  # target: 'http://ec2-54-175-78-80.compute-1.amazonaws.com:8083'
  target: 'http://ec2-34-230-14-140.compute-1.amazonaws.com:9000'
  phases:
    - duration: 60
      arrivalRate: 2
  # defaults:
  #   headers:
  #     x-my-service-auth: '987401838271002188298567'
  payload:
      path: "database/seed/datafiles/oneMillionMessages.csv"
      fields:
        - "houseId" 
        - "username"
        - "phone"
        - "email"
        - "note"
      skipHeader: true
scenarios:
  # - name: "A user looking at a listing"
  #   weight: 20
  #   flow:
  #     # - get:
  #     #     url: "/"
  #     #     json: 
  #     #       houseId: "{{ houseId }}"
  #     - get:
  #         url: "/{{$randomNumber(1, 10000000)}}"

  - name: "A user posting a message for a listing agent"
    weight: 1
    flow:
      - post:
          url: "/api"
          json: 
            houseId: "{{ houseId }}"
            username: "{{ username }}"
            phone: "{{ phone }}"
            email: "{{ email }}"
            note: "{{ note }}"