artillery.yml
config:
  target: 'http://localhost:8083/api'
  # target: 'http://localhost:9000/api'
  # CAREFUL about this from hack reactor IP address, it will get blocked
  # target: 'http://ec2-54-175-78-80.compute-1.amazonaws.com:8083/api'
  phases:
    - duration: 240
      arrivalRate: 200
  # defaults:
  #   headers:
  #     x-my-service-auth: '987401838271002188298567'
  payload:
      path: "database/seed/datafiles/oneMillionMessages.csv"
      fields:
        - "houseId" 
        - "username"
        - "phone"
        - "email"
        - "note"
      skipHeader: true
scenarios:
  - name: "A user looking at a listing"
    weight: 20
    flow:
      - get:
          url: "/"
          json: 
            houseId: "{{ houseId }}"
  - name: "A user posting a message for a listing agent"
    weight: 1
    flow:
      - post:
          url: "/"
          json: 
            houseId: "{{ houseId }}"
            username: "{{ username }}"
            phone: "{{ phone }}"
            email: "{{ email }}"
            note: "{{ note }}"